{
  "12.5.0": {
    "announcements": {
      "bug-fixes": [],
      "features": [
        "SODA will help resolve certain issues with starting the Pennsieve Agent that some users experience.",
        "SODA will show high level folders in Guided Mode and Free Form mode file structure review. These folders are expandable to show the rest of the dataset structure."
      ]
    }
  },
  "12.4.2": {
    "announcements": {
      "bug-fixes": ["Fixed Pennsieve login bug for accounts with Emails containing periods."],
      "features": []
    }
  },
  "12.4.1": {
    "announcements": {
      "features": [
        "Users can now upload data to Pennsieve even when an updated version of the Pennsieve Agent is detected but a release for their platform cannot be found."
      ]
    }
  },
  "12.4.0": {
    "announcements": {
      "bug-fixes": [],
      "features": [
        "Added a new feature to Guided Mode that allows you to import subjects, pools, and samples from an external spreadsheet. This feature is useful for datasets with a large amount of subjects/samples."
      ]
    }
  },
  "12.3.3": {
    "announcements": {
      "bug-fixes": [
        "SODA will always find and start the most up to date Pennsieve Agent installed on a user machine."
      ],
      "features": []
    }
  },
  "12.3.2": {
    "announcements": {
      "bug-fixes": [
        "Users with large amount of datasets will no longer receive errors when fetching their datasets within SODA for SPARC",
        "SODA for SPARC launches the Pennsieve Agent for macOS Ventura users.",
        "The `skip` existing files option in the `Organize dataset` upload feature works as intended once again."
      ],
      "features": []
    }
  },
  "12.3.1": {
    "announcements": {
      "bug-fixes": ["Fixed a bug allowing subjects and samples to be created without a name."],
      "features": []
    }
  },
  "12.3.0": {
    "announcements": {
      "bug-fixes": [
        "Fixed an issue where announcements for new SODA for SPARC features did not display.",
        "Fixed an issue in Free Form Mode's standalone dataset validator wherein the validation table would display even when validation failed to complete.",
        "Fixed a UI issue with moving groups of items from the file explorer.",
        "Manifest files generated by SODA for SPARC now have the correct file name when files are renamed within the virtual file explorer.",
        "Tippy popovers have been added to the Share with Curation Team button along with the Create Manifests button in Free Form Mode's Prepare Metadata section and Disseminate section.",
        "Error message on upload provided links and are now opened in another window rather than within SODA for SPARC.",
        "Curate and Share button's icon has been updated to be more intuitive. Changing color when it is selected.",
        "Return to progress button that appears in the nav bar will correctly update the navigation menu depending where the user navigates.",
        "Move item pop up has a max height preventing users from endlessly scrolling to confirm their move.",
        "Disseminate calendar does not hide anymore when checkbox to acknowledge sharing with the curation team. (Should only be modified by the embargo checkbox)",
        "Sweet alert icons for Prepare Metadata -> No 'metadata' file found in root directory will all be the same icon."
      ],
      "features": [
        "Uploads to new and existing Pennsieve datasets have been further optimized in SODA for SPARC.",
        "Importing datasets from Pennsieve have been further optimized in SODA for SPARC.",
        "Enhanced the user experience when importing folders and files into SODA.",
        "A button for gathering the user's Kombucha Analytics client ID is available in the 'Contact Us' page in the sidebar. This eases the user's burden when making a request to view/delete their analytics data as per GDPR.",
        "SODA for SPARC returns more informative and useful error messages to the client when a service that it depends on is unavailable or behaving unexpectedly."
      ]
    }
  }
}
