{
  "older": {
    "announcements": {
      "show": true,
      "title": "App version outdated",
      "message": "Please update to the latest version of the SODA by using our autoupdate feature or download from <a href='https://github.com/fairdataihub/SODA-for-SPARC/releases/tag/v9.0.0' target='_blank'>here</a>.",
      "type": "warning"
    }
  },

  "12.3.0-beta": {
    "announcements": {
      "show": true,
      "title": "Welcome to version 12.3.0 for Linux!",
      "bug-fixes": [
        "Fixed an issue where announcements for new SODA for SPARC features did not display",
        "Fixed an issue in Free Form Mode's standalone dataset validator wherein the validation table would display even when validation failed to complete.",
        "Fixed a UI issue with moving groups of items from the file explorer.",
        "Manifest files generated by SODA for SPARC now have the correct file name when files are renamed within the virtual file explorer.",
        "Tippy popovers have been added to the Share with Curation Team button along with the Create Manifests button in Free Form Mode's Prepare Metadata section and Disseminate section.",
        "Error message on upload provided links and are now opened in another window rather than within SODA for SPARC.",
        "Curate and Share button's icon has been updated to be more intuitive. Changing color when it is selected.",
        "Return to progress button that appears in the nav bar will correctly update the navigation menu depending where the user navigates.",
        "Move item pop up has a max height preventing users from endlessly scrolling to confirm their move.",
        "Disseminate calendar does not hide anymore when checkbox to acknowledge sharing with the curation team. (Should only be modified by the embargo checkbox)",
        "Sweet alert icons for Prepare Metadata -> No 'metadata' file found in root directory will all be the same icon."
      ],
      "features": [
        "SODA for SPARC uploads files/folders to existing Pennsieve datasets on average 47% faster than before!",
        "SODA for SPARC uploads new SODA created datasets onto Pennsieve on average 48% faster than before!",
        "Importing datasets from Pennsieve have been slightly improved on average by 10%!",
        "A button for gathering the user's Kombucha Analytics client ID is available in the 'Contact Us' page in the sidebar. This eases the user's burden when making a request to view/delete their analytics data as per GDPR.",
        "SODA for SPARC returns more informative and useful error messages to the client when a service that it depends on is unavailable or behaving unexpectedly."
      ],
      "message": "<div style='text-align:justify;overflow-y:auto;max-height:300px'><div style='margin-bottom:1rem'><label style='font-weight:700;font-size:15px'>Bug Fixes:<br></label><li>Free Form Mode's Standalone Validator feature no longer shows a validation results table when validation fails due to a user missing required metadata files.</li><li>Linking your ORCID ID with Pennsieve through SODA for SPARC no longer fails to authenticate when given a valid user profile.</li></div></div>",
      "type": "info"
    }
  }
}
